* Bindings

#+begin_src bash :results output
kn source binding create repositories-binding \
     --subject Service:serving.knative.dev/v1:repositories \
     --sink broker:default
#+end_src

#+RESULTS:

#+begin_src bash :results output
kn source binding create vcs-git-binding \
     --subject Service:serving.knative.dev/v1:vcs-git \
     --sink broker:default
#+end_src

#+RESULTS:
: Sink binding 'vcs-git-binding' created in namespace 'default'.

* Triggers

#+begin_src bash :results output
  kn trigger create done-git-trigger \
     --broker default \
     --filter type=git.done \
     --sink ksvc:repositories
#+end_src

#+RESULTS:

#+begin_src bash :results output
  kn trigger create process-git-trigger \
     --broker default \
     --filter type=git.process \
     --sink ksvc:vcs-git
#+end_src

#+RESULTS:
: Trigger 'process-git-trigger' successfully created in namespace 'default'.
